START_MESSAGE = """
Ну здорова. Если тебе нужно настоящее экспертное мнение, пригласи меня в чат и я тебе объясню, в чем ты не прав.
"""

HELP_MESSAGE = """
Ты че сдурел? Сам разбирайся, как будто мне ничем заняться
"""

ERROR_MESSAGE = """
Ну вот, ты и здесь что-то не так сделал, может перестанешь быть неудачником?
"""

ADD_BOT_TIP_MESSAGE = """
Ты можешь уже меня добавить в чат и не долбить мне мозг на этот счет?
"""

NOT_COMMAND_MESSAGE = """
Я не буду на тебя одного тратить время, добавь меня в чат и я выдам вам базу
"""

ADD_GROUP_EVENT_MESSAGE = """
Ну здорова. У вас уникальнейший случай спросить меня что-то стоящее и впитать базу
"""