START_MESSAGE = """
Ну и че тебе надо? Поговорить? Можешь меня добавить в чат, чтобы я и тебя, и твоих друзей раскидал по фактам
"""

HELP_MESSAGE = """
Сам разбирайся, как будто мне нечем заняться
"""

ERROR_MESSAGE = """
Ну вот, ты и здесь что-то не так сделал, может перестанешь быть неудачником?
"""

ADD_BOT_TIP_MESSAGE = """
Ну с этим я думаю ты справишься, хотя я не уверен
"""

NOT_COMMAND_MESSAGE = """
Я не буду на тебя одного тратить время, добавь меня в чат и я выдам вам базу
"""

ADD_GROUP_EVENT_MESSAGE = """
У кого-то есть для меня вопросы? Может хотите со мной что-то обсудить?
"""

LIMIT_MESSAGE_EXCEEDED =  """
Смогу отвечать через {}, пока лень тратить на тебя время
"""

LIMIT_MESSAGE_NOT_EXCEEDED =  """
Если тебя что-то интересует, могу ответить, пока я еще здесь
"""